posts/sicp-23-simvolicheskie-dannye/index.org
#+BEGIN_COMMENT
.. title: SICP 2.3 Символические данные.
.. slug: sicp-23-simvolicheskie-dannye
.. date: 2020-01-23 01:03:21 UTC+03:00
.. tags: sicp, scheme, symbolic_data
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT


* Упражнение 2.54

Два списка называются равными если они содержат одинаковые элементы в одной последовательности. Определите equal? как рекурсивную функцию сравнения при помощи eq?.
#+BEGIN_SRC scheme
(define (equal? a b)
  (if (not (and (pair? a) (pair? b)))
      (eq? a b)
      (and (equal? (car a) (car b)) (equal? (cdr a) (cdr b)))))
#+END_SRC

* Упражнение 2.55

#+BEGIN_SRC scheme
(car ''abracadabra)
;; '''asdfsfsf = (quote (quote asdfsfsf))
#+END_SRC

* Упражнение 2.56

Покажите как расширить базовое дифференцирование чтобы оно могло обрабатывать больше видов выражений. Например реализовав правило  $\frac{d(u^n)}{dx}=nu^{n-1}\frac{du}{dx}$ 
добавив условие на проверку экспоненты и реализовав определения exponentiation?, base, exponent и make-exponentiation.

#+BEGIN_SRC scheme
(define (exponentiation? x)
  (and (pair? x) (eq? (car x) '**)))
(define (base exponentiation) (cadr exponentiation))
(define (exponent exponentiation) (caddr exponentiation))

(define (make-exponentiation b1 e2)
  (cond ((=number? e2 0) 1)
        ((=number? e2 1) b1)
        ((=number? b1 0) 1)
        ((and (number? b1) (number? e2)) (expt b1 e2))
        (else (list '** b1 e2))))


(define (deriv exp var)
  (cond ((number? exp) 0)
        ((variable? exp)
         (if (same-variable? exp var) 1 0))
        ((sum? exp)
         (make-sum (deriv (addend exp) var)
                   (deriv (augend exp) var)))
        ((product? exp)
         (make-sum
           (make-product (multiplier exp)
                         (deriv (multiplicand exp) var))
           (make-product (deriv (multiplier exp) var)
                         (multiplicand exp))))
        ((exponentiation? exp)
         (make-product (make-product (exponent exp)
                                     (make-exponentiation (base exp)
                                                          (make-sum (exponent exp)
                                                                    -1)))
                       (deriv (base exp) var)))
        (else
         (error "unknown expression type -- DERIV" exp))))

(deriv '(** x 4) 'x)
#+END_SRC

