posts/sicp-23-simvolicheskie-dannye/index.org
* Упражнение 2.57

Расширьте программу для дифференцирования что бы сумма и умножение могло вычисляться двух или более под выражений. То есть что бы можно было писать так.

#+BEGIN_SRC scheme
(deriv '(* x y (+ x 3)) 'x)
#+END_SRC

Попробуйте добиться этого изменяя только представление суммы и умножения, не изменяя саму функцию deriv.

#+BEGIN_SRC scheme
(define (make-sum a1 a2 . an)
  (cond ((and (number? a1) (number? a2)) (append (list '+ (+ a1 a2)) an))
        (else (append (list '+ a1 a2) an))))

(define (make-product m1 m2 . mn)
  (cond ((or (=number? m1 0) (=number? m2 0)) 0)
        ;; ((=number? m1 1) m2)
        ;; ((=number? m2 1) m1)
        ((and (number? m1) (number? m2)) (append (list '+ (* m1 m2)) mn))
        (else (append (list '* m1 m2) mn))))

(define (addend s) (cadr s))
(define (augend s)
  (if (= (length s) 3)
      (caddr s)
      (append (list '+) (cdr (cdr s)))))

(define (multiplier p) (cadr p))
(define (multiplicand p)
  (if (= (length p) 3)
      (caddr p)
      (append (list '*) (cdr (cdr p)))))
#+END_SRC


