posts/sicp-23-simvolicheskie-dannye/index.org
* Упражнение 2.58

Предположим мы хотим записывать программу для дифференцирования в обычной математической нотации. [2/2]

- [X] предложите решение когда сумма и умножение всегда принимают два аргумента и приоритет выражений полностью задан скобками (x + (3 * (x + (y + 2))))

#+BEGIN_SRC scheme
(define (variable? x) (symbol? x))
(define (same-variable? v1 v2)
  (and (variable? v1) (variable? v2) (eq? v1 v2)))

(define (make-sum a1 a2) (append (list a1) (list '+) (list a2)))
(define (sum? x)
  (and (pair? x) (eq? (cadr x) '+)))
(define (addend s) (car s))
(define (augend s) (caddr s))
(addend (make-sum 1 2))
(augend (make-sum 1 2))

(define (make-product m1 m2) (append (list m1) (list '*) (list m2)))
(define (product? x)
  (and (pair? x) (eq? (cadr x) '*)))
(define (multiplier p) (car p))
(define (multiplicand p) (caddr p))
(make-product 1 2)
(product? (make-product 1 2))
(multiplier (make-product 1 2))
(multiplicand (make-product 1 2))
#+END_SRC

- [X] проблема становится сложнее если опустить необязательные скобки и подразумевать что умножение имеет приоритет над суммой, предложите свое решение для этого случая (x + 3 * (x + y + 2)) когда аргументов может быть более 2.

еще может быть вот такой случай (x + 3 * (x + y + 2) + (x * x)) тут после второй итерации нужно делать не умножение а ещё одну сумму.

#+BEGIN_SRC scheme
(define (search-first-operand-position op exp n)
  (if (or (not (pair? exp)) (null? exp) (< (length exp) 3))
      0
      (if (eq? (cadr exp) op)
          (+ n 1)
          (search-first-operand-position op (cdr (cdr exp)) (+ n 1)))))
(define (make-sum a1 a2) (append (list a1) (list '+) (list a2)))
(define (sum? s)
  (let ((fop (search-first-operand-position '+ s 0)))
    (> fop 0)))

(define (addend s)
  (let ((rev (reverse s)))
    (let ((fop (search-first-operand-position '+ rev 0)) (addends ()))
      (define (iter-shift ss n)
        (if (= n 0)
            ss
            (iter-shift (cdr (cdr ss)) (- n 1))))
      (define addends (iter-shift rev fop))
      (if (= (length addends) 1)
          (car addends)
          (reverse addends)))))

(define (augend s)
  (let ((fop (search-first-operand-position '+ s 0)) (aug ()))
    (define (iter-shift ss n)
      (if (= n 0)
          ss
          (iter-shift (cdr (cdr ss)) (- n 1))))
    (define aug (iter-shift s fop))
    (if (= (length aug) 1)
        (car aug)
        aug)))

(deriv '(x + 3 * (x + y + 2)) 'x)
#+END_SRC

