posts/sicp-23-simvolicheskie-dannye/index.html


<div id="outline-container-orgdda4d12" class="outline-2">
<h2 id="orgdda4d12">Упражнение 2.58</h2>
<div class="outline-text-2" id="text-orgdda4d12">
<p>
Предположим мы хотим записывать программу для дифференцирования в обычной математической нотации. <code>[2/2]</code>
</p>

<ul class="org-ul">
<li class="on">
<code>[X]</code> предложите решение когда сумма и умножение всегда принимают два аргумента и приоритет выражений полностью задан скобками (x + (3 * (x + (y + 2))))</li>
</ul>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">variable?</span> <span class="nv">x</span><span class="p">)</span> <span class="p">(</span><span class="nb">symbol? </span><span class="nv">x</span><span class="p">))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">same-variable?</span> <span class="nv">v1</span> <span class="nv">v2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">and </span><span class="p">(</span><span class="nf">variable?</span> <span class="nv">v1</span><span class="p">)</span> <span class="p">(</span><span class="nf">variable?</span> <span class="nv">v2</span><span class="p">)</span> <span class="p">(</span><span class="nb">eq? </span><span class="nv">v1</span> <span class="nv">v2</span><span class="p">)))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-sum</span> <span class="nv">a1</span> <span class="nv">a2</span><span class="p">)</span> <span class="p">(</span><span class="nb">append </span><span class="p">(</span><span class="nb">list </span><span class="nv">a1</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="ss">'+</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="nv">a2</span><span class="p">)))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">sum?</span> <span class="nv">x</span><span class="p">)</span>
  <span class="p">(</span><span class="k">and </span><span class="p">(</span><span class="nb">pair? </span><span class="nv">x</span><span class="p">)</span> <span class="p">(</span><span class="nb">eq? </span><span class="p">(</span><span class="nb">cadr </span><span class="nv">x</span><span class="p">)</span> <span class="ss">'+</span><span class="p">)))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">addend</span> <span class="nv">s</span><span class="p">)</span> <span class="p">(</span><span class="nb">car </span><span class="nv">s</span><span class="p">))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">augend</span> <span class="nv">s</span><span class="p">)</span> <span class="p">(</span><span class="nb">caddr </span><span class="nv">s</span><span class="p">))</span>
<span class="p">(</span><span class="nf">addend</span> <span class="p">(</span><span class="nf">make-sum</span> <span class="mi">1</span> <span class="mi">2</span><span class="p">))</span>
<span class="p">(</span><span class="nf">augend</span> <span class="p">(</span><span class="nf">make-sum</span> <span class="mi">1</span> <span class="mi">2</span><span class="p">))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-product</span> <span class="nv">m1</span> <span class="nv">m2</span><span class="p">)</span> <span class="p">(</span><span class="nb">append </span><span class="p">(</span><span class="nb">list </span><span class="nv">m1</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="ss">'*</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="nv">m2</span><span class="p">)))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">product?</span> <span class="nv">x</span><span class="p">)</span>
  <span class="p">(</span><span class="k">and </span><span class="p">(</span><span class="nb">pair? </span><span class="nv">x</span><span class="p">)</span> <span class="p">(</span><span class="nb">eq? </span><span class="p">(</span><span class="nb">cadr </span><span class="nv">x</span><span class="p">)</span> <span class="ss">'*</span><span class="p">)))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">multiplier</span> <span class="nv">p</span><span class="p">)</span> <span class="p">(</span><span class="nb">car </span><span class="nv">p</span><span class="p">))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">multiplicand</span> <span class="nv">p</span><span class="p">)</span> <span class="p">(</span><span class="nb">caddr </span><span class="nv">p</span><span class="p">))</span>
<span class="p">(</span><span class="nf">make-product</span> <span class="mi">1</span> <span class="mi">2</span><span class="p">)</span>
<span class="p">(</span><span class="nf">product?</span> <span class="p">(</span><span class="nf">make-product</span> <span class="mi">1</span> <span class="mi">2</span><span class="p">))</span>
<span class="p">(</span><span class="nf">multiplier</span> <span class="p">(</span><span class="nf">make-product</span> <span class="mi">1</span> <span class="mi">2</span><span class="p">))</span>
<span class="p">(</span><span class="nf">multiplicand</span> <span class="p">(</span><span class="nf">make-product</span> <span class="mi">1</span> <span class="mi">2</span><span class="p">))</span>
</pre></div>

<ul class="org-ul">
<li class="on">
<code>[X]</code> проблема становится сложнее если опустить необязательные скобки и подразумевать что умножение имеет приоритет над суммой, предложите свое решение для этого случая (x + 3 * (x + y + 2)) когда аргументов может быть более 2.</li>
</ul>
<p>
еще может быть вот такой случай (x + 3 * (x + y + 2) + (x * x)) тут после второй итерации нужно делать не умножение а ещё одну сумму.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">search-first-operand-position</span> <span class="nv">op</span> <span class="nv">exp</span> <span class="nv">n</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="k">or </span><span class="p">(</span><span class="nb">not </span><span class="p">(</span><span class="nb">pair? </span><span class="nv">exp</span><span class="p">))</span> <span class="p">(</span><span class="nb">null? </span><span class="nv">exp</span><span class="p">)</span> <span class="p">(</span><span class="nb">&lt; </span><span class="p">(</span><span class="nb">length </span><span class="nv">exp</span><span class="p">)</span> <span class="mi">3</span><span class="p">))</span>
      <span class="mi">0</span>
      <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">eq? </span><span class="p">(</span><span class="nb">cadr </span><span class="nv">exp</span><span class="p">)</span> <span class="nv">op</span><span class="p">)</span>
	  <span class="p">(</span><span class="nb">+ </span><span class="nv">n</span> <span class="mi">1</span><span class="p">)</span>
	  <span class="p">(</span><span class="nf">search-first-operand-position</span> <span class="nv">op</span> <span class="p">(</span><span class="nb">cdr </span><span class="p">(</span><span class="nb">cdr </span><span class="nv">exp</span><span class="p">))</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">n</span> <span class="mi">1</span><span class="p">)))))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-sum</span> <span class="nv">a1</span> <span class="nv">a2</span><span class="p">)</span> <span class="p">(</span><span class="nb">append </span><span class="p">(</span><span class="nb">list </span><span class="nv">a1</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="ss">'+</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="nv">a2</span><span class="p">)))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">sum?</span> <span class="nv">s</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">fop</span> <span class="p">(</span><span class="nf">search-first-operand-position</span> <span class="ss">'+</span> <span class="nv">s</span> <span class="mi">0</span><span class="p">)))</span>
    <span class="p">(</span><span class="nb">&gt; </span><span class="nv">fop</span> <span class="mi">0</span><span class="p">)))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">addend</span> <span class="nv">s</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">rev</span> <span class="p">(</span><span class="nb">reverse </span><span class="nv">s</span><span class="p">)))</span>
    <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">fop</span> <span class="p">(</span><span class="nf">search-first-operand-position</span> <span class="ss">'+</span> <span class="nv">rev</span> <span class="mi">0</span><span class="p">))</span> <span class="p">(</span><span class="nf">addends</span> <span class="p">()))</span>
      <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">iter-shift</span> <span class="nv">ss</span> <span class="nv">n</span><span class="p">)</span>
	<span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">= </span><span class="nv">n</span> <span class="mi">0</span><span class="p">)</span>
	    <span class="nv">ss</span>
	    <span class="p">(</span><span class="nf">iter-shift</span> <span class="p">(</span><span class="nb">cdr </span><span class="p">(</span><span class="nb">cdr </span><span class="nv">ss</span><span class="p">))</span> <span class="p">(</span><span class="nb">- </span><span class="nv">n</span> <span class="mi">1</span><span class="p">))))</span>
      <span class="p">(</span><span class="k">define </span><span class="nv">addends</span> <span class="p">(</span><span class="nf">iter-shift</span> <span class="nv">rev</span> <span class="nv">fop</span><span class="p">))</span>
      <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">= </span><span class="p">(</span><span class="nb">length </span><span class="nv">addends</span><span class="p">)</span> <span class="mi">1</span><span class="p">)</span>
	  <span class="p">(</span><span class="nb">car </span><span class="nv">addends</span><span class="p">)</span>
	  <span class="p">(</span><span class="nb">reverse </span><span class="nv">addends</span><span class="p">)))))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">augend</span> <span class="nv">s</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">fop</span> <span class="p">(</span><span class="nf">search-first-operand-position</span> <span class="ss">'+</span> <span class="nv">s</span> <span class="mi">0</span><span class="p">))</span> <span class="p">(</span><span class="nf">aug</span> <span class="p">()))</span>
    <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">iter-shift</span> <span class="nv">ss</span> <span class="nv">n</span><span class="p">)</span>
      <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">= </span><span class="nv">n</span> <span class="mi">0</span><span class="p">)</span>
	  <span class="nv">ss</span>
	  <span class="p">(</span><span class="nf">iter-shift</span> <span class="p">(</span><span class="nb">cdr </span><span class="p">(</span><span class="nb">cdr </span><span class="nv">ss</span><span class="p">))</span> <span class="p">(</span><span class="nb">- </span><span class="nv">n</span> <span class="mi">1</span><span class="p">))))</span>
    <span class="p">(</span><span class="k">define </span><span class="nv">aug</span> <span class="p">(</span><span class="nf">iter-shift</span> <span class="nv">s</span> <span class="nv">fop</span><span class="p">))</span>
    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">= </span><span class="p">(</span><span class="nb">length </span><span class="nv">aug</span><span class="p">)</span> <span class="mi">1</span><span class="p">)</span>
	<span class="p">(</span><span class="nb">car </span><span class="nv">aug</span><span class="p">)</span>
	<span class="nv">aug</span><span class="p">)))</span>

<span class="p">(</span><span class="nf">deriv</span> <span class="o">'</span><span class="p">(</span><span class="nv">x</span> <span class="nv">+</span> <span class="mi">3</span> <span class="nv">*</span> <span class="p">(</span><span class="nf">x</span> <span class="nv">+</span> <span class="nv">y</span> <span class="nv">+</span> <span class="mi">2</span><span class="p">))</span> <span class="ss">'x</span><span class="p">)</span>
</pre></div>
</div>
</div>
