posts/sicp-23-simvolicheskie-dannye/index.org
* Упражнение 2.63
Обе процедуры приведенные ниже трансформируют дерево в список.

#+BEGIN_SRC scheme
(define (tree->list-1 tree)
  (if (null? tree)
      '()
      (append (tree->list-1 (left-branch tree))
              (cons (entry tree)
                    (tree->list-1 (right-branch tree))))))
(define (tree->list-2 tree)
  (define (copy-to-list tree result-list)
    (if (null? tree)
        result-list
        (copy-to-list (left-branch tree)
                      (cons (entry tree)
                            (copy-to-list (right-branch tree)
                                          result-list)))))
  (copy-to-list tree '()))
#+END_SRC

a. Будут ли отличаться результаты двух процедур? Какие списки будут для дерева с рисунка 2.16

#+BEGIN_SRC scheme
(define tree1 (make-tree 7
                         (make-tree 3
                                    (make-tree 1 () ())
                                    (make-tree 5 () ()))
                         (make-tree 9
                                    ()
                                    (make-tree 11 () ()))))

tree1
(tree->list-1 tree1)
(tree->list-2 tree1)

(define tree2 (make-tree 3
                         (make-tree 7
                                    (make-tree 5 () ())
                                    (make-tree 9
                                               ()
                                               (make-tree 11 () ())))
                         (make-tree 1
                                    ()
                                    ())))

tree2
(tree->list-1 tree2)
(tree->list-2 tree2)

(define tree3 (make-tree 5
                         (make-tree 3
                                    (make-tree 1 () ())
                                    ())
                         (make-tree 9
                                    (make-tree 7 () ())
                                    (make-tree 11 () ()))))
tree3
(tree->list-1 tree3)
(tree->list-2 tree3)
#+END_SRC

списки одинаковые

b. как отличается порядок роста?
в первом случае за счет линейного времени append, порядок роста n*log(n)
во втором случае порядок роста будет n.

* Упражнение 2.64

Следующая процедура list->tree преобразует отсортированный список в сбалансированное бинарное дерево. Вспомогательная процедура partial-tree принимает в качестве аргументов целое n и список и строит сбалансированное  бинарное дерево содержащее первые n элементов списка. Результат это функции - пара, первое значение это созданное дерево, а cdr элементы не вошедшие в дерево.

#+BEGIN_SRC scheme
(define (list->tree elements)
  (car (partial-tree elements (length elements))))

(define (partial-tree elts n)
  (if (= n 0)
      (cons '() elts)
      (let ((left-size (quotient (- n 1) 2)))
        (let ((left-result (partial-tree elts left-size)))
          (let ((left-tree (car left-result))
                (non-left-elts (cdr left-result))
                (right-size (- n (+ left-size 1))))
            (let ((this-entry (car non-left-elts))
                  (right-result (partial-tree (cdr non-left-elts)
                                              right-size)))
              (let ((right-tree (car right-result))
                    (remaining-elts (cdr right-result)))
                (cons (make-tree this-entry left-tree right-tree)
                      remaining-elts))))))))
#+END_SRC

a. Кратко опишите как работает partial-tree. Нарисуйте дерево для списка (1 3 5 7 9 11).

Берем половину списка, строим от него дерево из первых int((n-1)/2 элементов. берем следующий элемент это будет вершина дерева, берем остальные элементы это будет правая часть дерева. для левой и правой стороны дерева процесс построения рекурсивно повторяется.

#+BEGIN_SRC scheme

;Value: ((5 (1 () (3 () ())) (9 (7 () ()) (11 () ()))))

           5
        /      \
       1         9
        \       /  \
     ()  3     7    11
        / \   /\    / \
       () () ()()  ()  ()

#+END_SRC

b. Каков порядок роста list->tree?

Порядок роста n.

