posts/sicp-23-simvolicheskie-dannye/index.html

<div id="outline-container-org2e59406" class="outline-2">
<h2 id="org2e59406">Упражнение 2.63</h2>
<div class="outline-text-2" id="text-org2e59406">
<p>
Обе процедуры приведенные ниже трансформируют дерево в список.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">tree-&gt;list-1</span> <span class="nv">tree</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">null? </span><span class="nv">tree</span><span class="p">)</span>
      <span class="o">'</span><span class="p">()</span>
      <span class="p">(</span><span class="nb">append </span><span class="p">(</span><span class="nf">tree-&gt;list-1</span> <span class="p">(</span><span class="nf">left-branch</span> <span class="nv">tree</span><span class="p">))</span>
	      <span class="p">(</span><span class="nb">cons </span><span class="p">(</span><span class="nf">entry</span> <span class="nv">tree</span><span class="p">)</span>
		    <span class="p">(</span><span class="nf">tree-&gt;list-1</span> <span class="p">(</span><span class="nf">right-branch</span> <span class="nv">tree</span><span class="p">))))))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">tree</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">copy-to-list</span> <span class="nv">tree</span> <span class="nv">result-list</span><span class="p">)</span>
    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">null? </span><span class="nv">tree</span><span class="p">)</span>
	<span class="nv">result-list</span>
	<span class="p">(</span><span class="nf">copy-to-list</span> <span class="p">(</span><span class="nf">left-branch</span> <span class="nv">tree</span><span class="p">)</span>
		      <span class="p">(</span><span class="nb">cons </span><span class="p">(</span><span class="nf">entry</span> <span class="nv">tree</span><span class="p">)</span>
			    <span class="p">(</span><span class="nf">copy-to-list</span> <span class="p">(</span><span class="nf">right-branch</span> <span class="nv">tree</span><span class="p">)</span>
					  <span class="nv">result-list</span><span class="p">)))))</span>
  <span class="p">(</span><span class="nf">copy-to-list</span> <span class="nv">tree</span> <span class="o">'</span><span class="p">()))</span>
</pre></div>

<p>
a. Будут ли отличаться результаты двух процедур? Какие списки будут для дерева с рисунка 2.16
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">tree1</span> <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">7</span>
			 <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">3</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">1</span> <span class="p">()</span> <span class="p">())</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">5</span> <span class="p">()</span> <span class="p">()))</span>
			 <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">9</span>
				    <span class="p">()</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">11</span> <span class="p">()</span> <span class="p">()))))</span>

<span class="nv">tree1</span>
<span class="p">(</span><span class="nf">tree-&gt;list-1</span> <span class="nv">tree1</span><span class="p">)</span>
<span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">tree1</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="nv">tree2</span> <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">3</span>
			 <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">7</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">5</span> <span class="p">()</span> <span class="p">())</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">9</span>
					       <span class="p">()</span>
					       <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">11</span> <span class="p">()</span> <span class="p">())))</span>
			 <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">1</span>
				    <span class="p">()</span>
				    <span class="p">())))</span>

<span class="nv">tree2</span>
<span class="p">(</span><span class="nf">tree-&gt;list-1</span> <span class="nv">tree2</span><span class="p">)</span>
<span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">tree2</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="nv">tree3</span> <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">5</span>
			 <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">3</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">1</span> <span class="p">()</span> <span class="p">())</span>
				    <span class="p">())</span>
			 <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">9</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">7</span> <span class="p">()</span> <span class="p">())</span>
				    <span class="p">(</span><span class="nf">make-tree</span> <span class="mi">11</span> <span class="p">()</span> <span class="p">()))))</span>
<span class="nv">tree3</span>
<span class="p">(</span><span class="nf">tree-&gt;list-1</span> <span class="nv">tree3</span><span class="p">)</span>
<span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">tree3</span><span class="p">)</span>
</pre></div>

<p>
списки одинаковые
</p>

<p>
b. как отличается порядок роста?
в первом случае за счет линейного времени append, порядок роста n*log(n)
во втором случае порядок роста будет n.
</p>
</div>
</div>

<div id="outline-container-orgd3375d6" class="outline-2">
<h2 id="orgd3375d6">Упражнение 2.64</h2>
<div class="outline-text-2" id="text-orgd3375d6">
<p>
Следующая процедура list-&gt;tree преобразует отсортированный список в сбалансированное бинарное дерево. Вспомогательная процедура partial-tree принимает в качестве аргументов целое n и список и строит сбалансированное  бинарное дерево содержащее первые n элементов списка. Результат это функции - пара, первое значение это созданное дерево, а cdr элементы не вошедшие в дерево.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">list-&gt;tree</span> <span class="nv">elements</span><span class="p">)</span>
  <span class="p">(</span><span class="nb">car </span><span class="p">(</span><span class="nf">partial-tree</span> <span class="nv">elements</span> <span class="p">(</span><span class="nb">length </span><span class="nv">elements</span><span class="p">))))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">partial-tree</span> <span class="nv">elts</span> <span class="nv">n</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">= </span><span class="nv">n</span> <span class="mi">0</span><span class="p">)</span>
      <span class="p">(</span><span class="nb">cons </span><span class="o">'</span><span class="p">()</span> <span class="nv">elts</span><span class="p">)</span>
      <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">left-size</span> <span class="p">(</span><span class="nb">quotient </span><span class="p">(</span><span class="nb">- </span><span class="nv">n</span> <span class="mi">1</span><span class="p">)</span> <span class="mi">2</span><span class="p">)))</span>
	<span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">left-result</span> <span class="p">(</span><span class="nf">partial-tree</span> <span class="nv">elts</span> <span class="nv">left-size</span><span class="p">)))</span>
	  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">left-tree</span> <span class="p">(</span><span class="nb">car </span><span class="nv">left-result</span><span class="p">))</span>
		<span class="p">(</span><span class="nf">non-left-elts</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">left-result</span><span class="p">))</span>
		<span class="p">(</span><span class="nf">right-size</span> <span class="p">(</span><span class="nb">- </span><span class="nv">n</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">left-size</span> <span class="mi">1</span><span class="p">))))</span>
	    <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">this-entry</span> <span class="p">(</span><span class="nb">car </span><span class="nv">non-left-elts</span><span class="p">))</span>
		  <span class="p">(</span><span class="nf">right-result</span> <span class="p">(</span><span class="nf">partial-tree</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">non-left-elts</span><span class="p">)</span>
					      <span class="nv">right-size</span><span class="p">)))</span>
	      <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">right-tree</span> <span class="p">(</span><span class="nb">car </span><span class="nv">right-result</span><span class="p">))</span>
		    <span class="p">(</span><span class="nf">remaining-elts</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">right-result</span><span class="p">)))</span>
		<span class="p">(</span><span class="nb">cons </span><span class="p">(</span><span class="nf">make-tree</span> <span class="nv">this-entry</span> <span class="nv">left-tree</span> <span class="nv">right-tree</span><span class="p">)</span>
		      <span class="nv">remaining-elts</span><span class="p">))))))))</span>
</pre></div>

<p>
a. Кратко опишите как работает partial-tree. Нарисуйте дерево для списка (1 3 5 7 9 11).
</p>

<p>
Берем половину списка, строим от него дерево из первых int((n-1)/2 элементов. берем следующий элемент это будет вершина дерева, берем остальные элементы это будет правая часть дерева. для левой и правой стороны дерева процесс построения рекурсивно повторяется.
</p>

<div class="highlight"><pre><span></span><span class="c1">;Value: ((5 (1 () (3 () ())) (9 (7 () ()) (11 () ()))))</span>

	   <span class="mi">5</span>
	<span class="nv">/</span>      <span class="err">\</span>
       <span class="mi">1</span>         <span class="mi">9</span>
	<span class="err">\</span>       <span class="nv">/</span>  <span class="err">\</span>
     <span class="p">()</span>  <span class="mi">3</span>     <span class="mi">7</span>    <span class="mi">11</span>
	<span class="nv">/</span> <span class="err">\</span>   <span class="nv">/</span><span class="err">\</span>    <span class="nv">/</span> <span class="err">\</span>
       <span class="p">()</span> <span class="p">()</span> <span class="p">()()</span>  <span class="p">()</span>  <span class="p">()</span>
</pre></div>

<p>
b. Каков порядок роста list-&gt;tree?
</p>

<p>
Порядок роста n.
</p>
</div>
</div>
