posts/sicp-23-simvolicheskie-dannye/index.org
* Упражнение 2.65

Используя результаты упражнений 2.63 и 2.64 приведите определение union-set и intersection-set для множеств определенных как сбалансированные бинарные деревья.

#+BEGIN_SRC scheme

        4                     7
      /  \                /      \
     3    5              1         9
    / \   / \              \       /  \
  ()   1 6   11         ()  3     8    11
                           / \   /\    / \
                          () () ()()  ()  ()

(define (union-tree-set set1 set2)
  (let ((orderedlist1 (tree->list-2 set1)) (orderedlist2 (tree->list-2 set2)))
    (define (union-set set1 set2)
      (cond ((null? set1) set2)
            ((null? set2) set1)
            (else (let ((x1 (car set1)) (x2 (car set2)))
                    (cond ((= x1 x2)
                           (cons x1
                                 (union-set (cdr set1)
                                            (cdr set2))))
                          ((< x1 x2)
                           (cons x1 (union-set (cdr set1) set2)))
                          ((< x2 x1)
                           (cons x2 (union-set set1 (cdr set2)))))))))

    (list->tree (union-set orderedlist1 orderedlist2))))

(define (intersection-tree-set set1 set2)
  (let ((orderedlist1 (tree->list-2 set1)) (orderedlist2 (tree->list-2 set2)))
    (define (intersection-set set1 set2)
      (if (or (null? set1) (null? set2))
          '()
          (let ((x1 (car set1)) (x2 (car set2)))
            (cond ((= x1 x2)
                   (cons x1
                         (intersection-set (cdr set1)
                                           (cdr set2))))
                  ((< x1 x2)
                   (intersection-set (cdr set1) set2))
                  ((< x2 x1)
                   (intersection-set set1 (cdr set2)))))))
    (list->tree (intersection-set orderedlist1 orderedlist2))))
#+END_SRC

так как tree->list-2, list->tree и intersection-set, union-set (на сортированных списках) имеют порядок роста n, то и последовательное применение этих алгоритмов также имеет такой же порядок роста.

* Упражнение 2.66

Определите lookup для бинарного дерева.

#+BEGIN_SRC scheme
(define (lookup given-key tree)
  (cond ((null? tree) false)
        ((equal? given-key (entry tree)) (entry tree))
        ((> given-key (entry tree)) (lookup given-key (right-branch tree)))
        ((< given-key (entry tree)) (lookup given-key (left-branch tree)))))
#+END_SRC

log n

* Упражнение 2.67

Дано кодирующее дерево и сообщение, используя decode расшифруйте сообщение.

#+BEGIN_SRC scheme
(define sample-tree
  (make-code-tree (make-leaf 'A 4)
                  (make-code-tree
                   (make-leaf 'B 2)
                   (make-code-tree (make-leaf 'D 1)
                                   (make-leaf 'C 1)))))

(define sample-message '(0 1 1 0 0 1 0 1 0 1 1 1 0))
(decode sample-message sample-tree)
;Value: (a d a b b c a)
#+END_SRC

