posts/sicp-23-simvolicheskie-dannye/index.html

<div id="outline-container-orgc94bc7d" class="outline-2">
<h2 id="orgc94bc7d">Упражнение 2.65</h2>
<div class="outline-text-2" id="text-orgc94bc7d">
<p>
Используя результаты упражнений 2.63 и 2.64 приведите определение union-set и intersection-set для множеств определенных как сбалансированные бинарные деревья.
</p>

<div class="highlight"><pre><span></span>	<span class="mi">4</span>                     <span class="mi">7</span>
      <span class="nv">/</span>  <span class="err">\</span>                <span class="nv">/</span>      <span class="err">\</span>
     <span class="mi">3</span>    <span class="mi">5</span>              <span class="mi">1</span>         <span class="mi">9</span>
    <span class="nv">/</span> <span class="err">\</span>   <span class="nv">/</span> <span class="err">\</span>              <span class="err">\</span>       <span class="nv">/</span>  <span class="err">\</span>
  <span class="p">()</span>   <span class="mi">1</span> <span class="mi">6</span>   <span class="mi">11</span>         <span class="p">()</span>  <span class="mi">3</span>     <span class="mi">8</span>    <span class="mi">11</span>
			   <span class="nv">/</span> <span class="err">\</span>   <span class="nv">/</span><span class="err">\</span>    <span class="nv">/</span> <span class="err">\</span>
			  <span class="p">()</span> <span class="p">()</span> <span class="p">()()</span>  <span class="p">()</span>  <span class="p">()</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">union-tree-set</span> <span class="nv">set1</span> <span class="nv">set2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">orderedlist1</span> <span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">set1</span><span class="p">))</span> <span class="p">(</span><span class="nf">orderedlist2</span> <span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">set2</span><span class="p">)))</span>
    <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">union-set</span> <span class="nv">set1</span> <span class="nv">set2</span><span class="p">)</span>
      <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">null? </span><span class="nv">set1</span><span class="p">)</span> <span class="nv">set2</span><span class="p">)</span>
	    <span class="p">((</span><span class="nb">null? </span><span class="nv">set2</span><span class="p">)</span> <span class="nv">set1</span><span class="p">)</span>
	    <span class="p">(</span><span class="k">else </span><span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">x1</span> <span class="p">(</span><span class="nb">car </span><span class="nv">set1</span><span class="p">))</span> <span class="p">(</span><span class="nf">x2</span> <span class="p">(</span><span class="nb">car </span><span class="nv">set2</span><span class="p">)))</span>
		    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">= </span><span class="nv">x1</span> <span class="nv">x2</span><span class="p">)</span>
			   <span class="p">(</span><span class="nb">cons </span><span class="nv">x1</span>
				 <span class="p">(</span><span class="nf">union-set</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set1</span><span class="p">)</span>
					    <span class="p">(</span><span class="nb">cdr </span><span class="nv">set2</span><span class="p">))))</span>
			  <span class="p">((</span><span class="nb">&lt; </span><span class="nv">x1</span> <span class="nv">x2</span><span class="p">)</span>
			   <span class="p">(</span><span class="nb">cons </span><span class="nv">x1</span> <span class="p">(</span><span class="nf">union-set</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set1</span><span class="p">)</span> <span class="nv">set2</span><span class="p">)))</span>
			  <span class="p">((</span><span class="nb">&lt; </span><span class="nv">x2</span> <span class="nv">x1</span><span class="p">)</span>
			   <span class="p">(</span><span class="nb">cons </span><span class="nv">x2</span> <span class="p">(</span><span class="nf">union-set</span> <span class="nv">set1</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set2</span><span class="p">)))))))))</span>

    <span class="p">(</span><span class="nf">list-&gt;tree</span> <span class="p">(</span><span class="nf">union-set</span> <span class="nv">orderedlist1</span> <span class="nv">orderedlist2</span><span class="p">))))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">intersection-tree-set</span> <span class="nv">set1</span> <span class="nv">set2</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">orderedlist1</span> <span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">set1</span><span class="p">))</span> <span class="p">(</span><span class="nf">orderedlist2</span> <span class="p">(</span><span class="nf">tree-&gt;list-2</span> <span class="nv">set2</span><span class="p">)))</span>
    <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">intersection-set</span> <span class="nv">set1</span> <span class="nv">set2</span><span class="p">)</span>
      <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="k">or </span><span class="p">(</span><span class="nb">null? </span><span class="nv">set1</span><span class="p">)</span> <span class="p">(</span><span class="nb">null? </span><span class="nv">set2</span><span class="p">))</span>
	  <span class="o">'</span><span class="p">()</span>
	  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">x1</span> <span class="p">(</span><span class="nb">car </span><span class="nv">set1</span><span class="p">))</span> <span class="p">(</span><span class="nf">x2</span> <span class="p">(</span><span class="nb">car </span><span class="nv">set2</span><span class="p">)))</span>
	    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">= </span><span class="nv">x1</span> <span class="nv">x2</span><span class="p">)</span>
		   <span class="p">(</span><span class="nb">cons </span><span class="nv">x1</span>
			 <span class="p">(</span><span class="nf">intersection-set</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set1</span><span class="p">)</span>
					   <span class="p">(</span><span class="nb">cdr </span><span class="nv">set2</span><span class="p">))))</span>
		  <span class="p">((</span><span class="nb">&lt; </span><span class="nv">x1</span> <span class="nv">x2</span><span class="p">)</span>
		   <span class="p">(</span><span class="nf">intersection-set</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set1</span><span class="p">)</span> <span class="nv">set2</span><span class="p">))</span>
		  <span class="p">((</span><span class="nb">&lt; </span><span class="nv">x2</span> <span class="nv">x1</span><span class="p">)</span>
		   <span class="p">(</span><span class="nf">intersection-set</span> <span class="nv">set1</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set2</span><span class="p">)))))))</span>
    <span class="p">(</span><span class="nf">list-&gt;tree</span> <span class="p">(</span><span class="nf">intersection-set</span> <span class="nv">orderedlist1</span> <span class="nv">orderedlist2</span><span class="p">))))</span>
</pre></div>

<p>
так как tree-&gt;list-2, list-&gt;tree и intersection-set, union-set (на сортированных списках) имеют порядок роста n, то и последовательное применение этих алгоритмов также имеет такой же порядок роста.
</p>
</div>
</div>

<div id="outline-container-orgce19218" class="outline-2">
<h2 id="orgce19218">Упражнение 2.66</h2>
<div class="outline-text-2" id="text-orgce19218">
<p>
Определите lookup для бинарного дерева.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">lookup</span> <span class="nv">given-key</span> <span class="nv">tree</span><span class="p">)</span>
  <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">null? </span><span class="nv">tree</span><span class="p">)</span> <span class="nv">false</span><span class="p">)</span>
	<span class="p">((</span><span class="nb">equal? </span><span class="nv">given-key</span> <span class="p">(</span><span class="nf">entry</span> <span class="nv">tree</span><span class="p">))</span> <span class="p">(</span><span class="nf">entry</span> <span class="nv">tree</span><span class="p">))</span>
	<span class="p">((</span><span class="nb">&gt; </span><span class="nv">given-key</span> <span class="p">(</span><span class="nf">entry</span> <span class="nv">tree</span><span class="p">))</span> <span class="p">(</span><span class="nf">lookup</span> <span class="nv">given-key</span> <span class="p">(</span><span class="nf">right-branch</span> <span class="nv">tree</span><span class="p">)))</span>
	<span class="p">((</span><span class="nb">&lt; </span><span class="nv">given-key</span> <span class="p">(</span><span class="nf">entry</span> <span class="nv">tree</span><span class="p">))</span> <span class="p">(</span><span class="nf">lookup</span> <span class="nv">given-key</span> <span class="p">(</span><span class="nf">left-branch</span> <span class="nv">tree</span><span class="p">)))))</span>
</pre></div>

<p>
log n
</p>
</div>
</div>

<div id="outline-container-orge488258" class="outline-2">
<h2 id="orge488258">Упражнение 2.67</h2>
<div class="outline-text-2" id="text-orge488258">
<p>
Дано кодирующее дерево и сообщение, используя decode расшифруйте сообщение.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">sample-tree</span>
  <span class="p">(</span><span class="nf">make-code-tree</span> <span class="p">(</span><span class="nf">make-leaf</span> <span class="ss">'A</span> <span class="mi">4</span><span class="p">)</span>
		  <span class="p">(</span><span class="nf">make-code-tree</span>
		   <span class="p">(</span><span class="nf">make-leaf</span> <span class="ss">'B</span> <span class="mi">2</span><span class="p">)</span>
		   <span class="p">(</span><span class="nf">make-code-tree</span> <span class="p">(</span><span class="nf">make-leaf</span> <span class="ss">'D</span> <span class="mi">1</span><span class="p">)</span>
				   <span class="p">(</span><span class="nf">make-leaf</span> <span class="ss">'C</span> <span class="mi">1</span><span class="p">)))))</span>

<span class="p">(</span><span class="k">define </span><span class="nv">sample-message</span> <span class="o">'</span><span class="p">(</span><span class="mi">0</span> <span class="mi">1</span> <span class="mi">1</span> <span class="mi">0</span> <span class="mi">0</span> <span class="mi">1</span> <span class="mi">0</span> <span class="mi">1</span> <span class="mi">0</span> <span class="mi">1</span> <span class="mi">1</span> <span class="mi">1</span> <span class="mi">0</span><span class="p">))</span>
<span class="p">(</span><span class="nf">decode</span> <span class="nv">sample-message</span> <span class="nv">sample-tree</span><span class="p">)</span>
<span class="c1">;Value: (a d a b b c a)</span>
</pre></div>
</div>
</div>
