posts/sicp-23-simvolicheskie-dannye/index.org
* Упражнение 2.68
Процедура encode принимает на вход сообщение и дерево и генерирует последовательность бит.

#+BEGIN_SRC scheme
(define (in-list? symbol symbols)
  (if (null? symbols)
      false
      (if (equal? symbol (car symbols))
          true
          (in-list? symbol (cdr symbols)))))
(in-list? 'A '(b c a))

(define (encode-symbol symbol tree)
  (let ((l-branch (left-branch tree))
        (r-branch (right-branch tree)))
    (cond ((in-list? symbol (symbols l-branch)) (if (leaf? l-branch)
                                                    (cons '0 ())
                                                    (cons '0 (encode-symbol symbol l-branch))))
          ((in-list? symbol (symbols r-branch)) (if (leaf? r-branch)
                                                    (cons '1 ())
                                                    (cons '1 (encode-symbol symbol r-branch))))
          (else
           (error "not exist symbol -- ENCODE-SYMBOL" symbol)))))
(encode '(a d a b b c a) sample-tree) ;Value: (0 1 1 0 0 1 0 1 0 1 1 1 0)
#+END_SRC

Encode-symbol - процедура кодирующая один символ. Дайте определение этой процедуры. Протестируйте на результате упражнения 2.67.

* Упражнение 2.69

Следующая процедура генерирует дерево по Хафману из пар символ-частота.

#+BEGIN_SRC scheme
(define (generate-huffman-tree pairs)
  (successive-merge (make-leaf-set pairs)))
#+END_SRC

Make-leaf-set, процедура приведенная выше, сортирует пары. Нужно дать определение процедуры successive-merge, которая делает слияние элементов с наименьшим весом, пока не останется один элемент.

#+BEGIN_SRC scheme
;; вставка отсортированная по весу
(define (adjoin-set x set)
  (cond ((null? set) (list x))
        ((< (weight x) (weight (car set))) (cons x set))
        (else (cons (car set)
                    (adjoin-set x (cdr set))))))

;; получаем сортированный список листов.
(define (make-leaf-set pairs)
  (if (null? pairs)
      '()
      (let ((pair (car pairs)))
        (adjoin-set (make-leaf (car pair)    ; symbol
                               (cadr pair))  ; frequency
                    (make-leaf-set (cdr pairs))))))
(define (successive-merge opairs)
  (if (< (length opairs) 2)
      (car opairs)
      (let ((merged (make-code-tree (car opairs) (cadr opairs))))
        (display merged)
        (newline)
        (successive-merge (adjoin-set merged (cdr (cdr opairs)))))))

(define (generate-huffman-tree pairs)
  (successive-merge (make-leaf-set pairs)))

(define gentree (generate-huffman-tree (list (list 'A 4) (list 'B 2) (list 'C 1) (list 'D 1))))
gentree
(symbols gentree)

(encode '(a d a b b c a) gentree)
#+END_SRC


