posts/sicp-23-simvolicheskie-dannye/index.html

<div id="outline-container-orge6697ff" class="outline-2">
<h2 id="orge6697ff">Упражнение 2.68</h2>
<div class="outline-text-2" id="text-orge6697ff">
<p>
Процедура encode принимает на вход сообщение и дерево и генерирует последовательность бит.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">in-list?</span> <span class="nv">symbol</span> <span class="nv">symbols</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">null? </span><span class="nv">symbols</span><span class="p">)</span>
      <span class="nv">false</span>
      <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">equal? </span><span class="nv">symbol</span> <span class="p">(</span><span class="nb">car </span><span class="nv">symbols</span><span class="p">))</span>
	  <span class="nv">true</span>
	  <span class="p">(</span><span class="nf">in-list?</span> <span class="nv">symbol</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">symbols</span><span class="p">)))))</span>
<span class="p">(</span><span class="nf">in-list?</span> <span class="ss">'A</span> <span class="o">'</span><span class="p">(</span><span class="nv">b</span> <span class="nv">c</span> <span class="nv">a</span><span class="p">))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">encode-symbol</span> <span class="nv">symbol</span> <span class="nv">tree</span><span class="p">)</span>
  <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">l-branch</span> <span class="p">(</span><span class="nf">left-branch</span> <span class="nv">tree</span><span class="p">))</span>
	<span class="p">(</span><span class="nf">r-branch</span> <span class="p">(</span><span class="nf">right-branch</span> <span class="nv">tree</span><span class="p">)))</span>
    <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nf">in-list?</span> <span class="nv">symbol</span> <span class="p">(</span><span class="nf">symbols</span> <span class="nv">l-branch</span><span class="p">))</span> <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">leaf?</span> <span class="nv">l-branch</span><span class="p">)</span>
						    <span class="p">(</span><span class="nb">cons </span><span class="ss">'0</span> <span class="p">())</span>
						    <span class="p">(</span><span class="nb">cons </span><span class="ss">'0</span> <span class="p">(</span><span class="nf">encode-symbol</span> <span class="nv">symbol</span> <span class="nv">l-branch</span><span class="p">))))</span>
	  <span class="p">((</span><span class="nf">in-list?</span> <span class="nv">symbol</span> <span class="p">(</span><span class="nf">symbols</span> <span class="nv">r-branch</span><span class="p">))</span> <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">leaf?</span> <span class="nv">r-branch</span><span class="p">)</span>
						    <span class="p">(</span><span class="nb">cons </span><span class="ss">'1</span> <span class="p">())</span>
						    <span class="p">(</span><span class="nb">cons </span><span class="ss">'1</span> <span class="p">(</span><span class="nf">encode-symbol</span> <span class="nv">symbol</span> <span class="nv">r-branch</span><span class="p">))))</span>
	  <span class="p">(</span><span class="nf">else</span>
	   <span class="p">(</span><span class="nf">error</span> <span class="s">"not exist symbol -- ENCODE-SYMBOL"</span> <span class="nv">symbol</span><span class="p">)))))</span>
<span class="p">(</span><span class="nf">encode</span> <span class="o">'</span><span class="p">(</span><span class="nv">a</span> <span class="nv">d</span> <span class="nv">a</span> <span class="nv">b</span> <span class="nv">b</span> <span class="nv">c</span> <span class="nv">a</span><span class="p">)</span> <span class="nv">sample-tree</span><span class="p">)</span> <span class="c1">;Value: (0 1 1 0 0 1 0 1 0 1 1 1 0)</span>
</pre></div>

<p>
Encode-symbol - процедура кодирующая один символ. Дайте определение этой процедуры. Протестируйте на результате упражнения 2.67.
</p>
</div>
</div>

<div id="outline-container-org6356635" class="outline-2">
<h2 id="org6356635">Упражнение 2.69</h2>
<div class="outline-text-2" id="text-org6356635">
<p>
Следующая процедура генерирует дерево по Хафману из пар символ-частота.
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">generate-huffman-tree</span> <span class="nv">pairs</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">successive-merge</span> <span class="p">(</span><span class="nf">make-leaf-set</span> <span class="nv">pairs</span><span class="p">)))</span>
</pre></div>

<p>
Make-leaf-set, процедура приведенная выше, сортирует пары. Нужно дать определение процедуры successive-merge, которая делает слияние элементов с наименьшим весом, пока не останется один элемент.
</p>

<div class="highlight"><pre><span></span><span class="c1">;; вставка отсортированная по весу</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">adjoin-set</span> <span class="nv">x</span> <span class="nv">set</span><span class="p">)</span>
  <span class="p">(</span><span class="k">cond </span><span class="p">((</span><span class="nb">null? </span><span class="nv">set</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="nv">x</span><span class="p">))</span>
	<span class="p">((</span><span class="nb">&lt; </span><span class="p">(</span><span class="nf">weight</span> <span class="nv">x</span><span class="p">)</span> <span class="p">(</span><span class="nf">weight</span> <span class="p">(</span><span class="nb">car </span><span class="nv">set</span><span class="p">)))</span> <span class="p">(</span><span class="nb">cons </span><span class="nv">x</span> <span class="nv">set</span><span class="p">))</span>
	<span class="p">(</span><span class="k">else </span><span class="p">(</span><span class="nb">cons </span><span class="p">(</span><span class="nb">car </span><span class="nv">set</span><span class="p">)</span>
		    <span class="p">(</span><span class="nf">adjoin-set</span> <span class="nv">x</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">set</span><span class="p">))))))</span>

<span class="c1">;; получаем сортированный список листов.</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">make-leaf-set</span> <span class="nv">pairs</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">null? </span><span class="nv">pairs</span><span class="p">)</span>
      <span class="o">'</span><span class="p">()</span>
      <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">pair</span> <span class="p">(</span><span class="nb">car </span><span class="nv">pairs</span><span class="p">)))</span>
	<span class="p">(</span><span class="nf">adjoin-set</span> <span class="p">(</span><span class="nf">make-leaf</span> <span class="p">(</span><span class="nb">car </span><span class="nv">pair</span><span class="p">)</span>    <span class="c1">; symbol</span>
			       <span class="p">(</span><span class="nb">cadr </span><span class="nv">pair</span><span class="p">))</span>  <span class="c1">; frequency</span>
		    <span class="p">(</span><span class="nf">make-leaf-set</span> <span class="p">(</span><span class="nb">cdr </span><span class="nv">pairs</span><span class="p">))))))</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">successive-merge</span> <span class="nv">opairs</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">&lt; </span><span class="p">(</span><span class="nb">length </span><span class="nv">opairs</span><span class="p">)</span> <span class="mi">2</span><span class="p">)</span>
      <span class="p">(</span><span class="nb">car </span><span class="nv">opairs</span><span class="p">)</span>
      <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">merged</span> <span class="p">(</span><span class="nf">make-code-tree</span> <span class="p">(</span><span class="nb">car </span><span class="nv">opairs</span><span class="p">)</span> <span class="p">(</span><span class="nb">cadr </span><span class="nv">opairs</span><span class="p">))))</span>
	<span class="p">(</span><span class="nb">display </span><span class="nv">merged</span><span class="p">)</span>
	<span class="p">(</span><span class="nf">newline</span><span class="p">)</span>
	<span class="p">(</span><span class="nf">successive-merge</span> <span class="p">(</span><span class="nf">adjoin-set</span> <span class="nv">merged</span> <span class="p">(</span><span class="nb">cdr </span><span class="p">(</span><span class="nb">cdr </span><span class="nv">opairs</span><span class="p">)))))))</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">generate-huffman-tree</span> <span class="nv">pairs</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">successive-merge</span> <span class="p">(</span><span class="nf">make-leaf-set</span> <span class="nv">pairs</span><span class="p">)))</span>

<span class="p">(</span><span class="k">define </span><span class="nv">gentree</span> <span class="p">(</span><span class="nf">generate-huffman-tree</span> <span class="p">(</span><span class="nb">list </span><span class="p">(</span><span class="nb">list </span><span class="ss">'A</span> <span class="mi">4</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="ss">'B</span> <span class="mi">2</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="ss">'C</span> <span class="mi">1</span><span class="p">)</span> <span class="p">(</span><span class="nb">list </span><span class="ss">'D</span> <span class="mi">1</span><span class="p">))))</span>
<span class="nv">gentree</span>
<span class="p">(</span><span class="nf">symbols</span> <span class="nv">gentree</span><span class="p">)</span>

<span class="p">(</span><span class="nf">encode</span> <span class="o">'</span><span class="p">(</span><span class="nv">a</span> <span class="nv">d</span> <span class="nv">a</span> <span class="nv">b</span> <span class="nv">b</span> <span class="nv">c</span> <span class="nv">a</span><span class="p">)</span> <span class="nv">gentree</span><span class="p">)</span>
</pre></div>
</div>
</div>
